3DR/S4/background/system/pointLocation4.txt
( 3.150 0.340 0.000 )
( 3.112 0.340 0.041 )
( 3.078 0.340 0.085 )
( 3.046 0.340 0.131 )
( 3.016 0.340 0.178 )
( 2.989 0.340 0.227 )
( 2.964 0.340 0.277 )
( 2.940 0.340 0.328 )
( 2.918 0.340 0.379 )
( 2.897 0.340 0.431 )
( 2.877 0.340 0.483 )
